import React from "react";
import Navbar from "./Navbar";
import Carousel from "./Carousel";

import helpImg1 from '../../images/home/help/1.png'
import helpImg2 from '../../images/home/help/2.png'
import helpImg3 from '../../images/home/help/3.png'
import helpImg4 from '../../images/home/help/4.png'

import aboutUs from '../../images/home/aboutUs/about.jpg'
import vegroup from '../../images/home/aboutUs/wegroup.jpeg'
import vegroup2 from '../../images/home/aboutUs/wegroup2.jpg'
import doxv from '../../images/home/aboutUs/doxv.jpg'
import Footer from "./Footer";

import './CSS/Home.css'

export default function Home() {
    return (
        <div >
            <Navbar />
            <Carousel />

            <div className="help mt-5">
                <div className="row w-100">
                    <div className="col-md-3">
                        <img src={helpImg1} className='img-fluid ' alt="" />
                        <h1>Всегда Под <br />  Рукой</h1>
                        <p>Вы сможете посмотреть карту, <br /> не посещая поликлинику</p>
                    </div>
                    <div className="col-md-3">
                        <img src={helpImg2} className='img-fluid' alt="" />
                        <h1>Надежное <br /> Хранение</h1>
                        <p>Вы не потеряете документы и <br /> не забудете их дома</p>
                    </div>
                    <div className="col-md-3">
                        <img src={helpImg3} className='img-fluid' alt="" />
                        <h1>Удобный <br /> Интерфейс</h1>
                        <p>Вы сможете легко и быстро <br /> найти необходимую <br /> информацию</p>
                    </div>
                    <div className="col-md-3">
                        <img src={helpImg4} className='img-fluid ' alt="" />
                        <h1>Новый <br /> Уровень</h1>
                        <p>Повышения качества <br /> медицинской помощи</p>
                    </div>
                </div>
            </div>

            {/* about us */}

            <div id="about" className="aboutUs">
                <img src={aboutUs} alt="" />
                <h1>ABOUT <br /> US</h1>
            </div>
            <div className="container">

                    <div className="aboutUsText row">
                        <div className="col-md-6">
                            <p>В MedicalCard мы хотим показать вам будущее медицины. Для этого нам пришлось понять чего не хватает нашим поликлиникам и для этого мы придумали этот сайт. Мы сделали один из самых удобных сайтов для пользования людям . У нас получилось облегчить вам пользование Медицинскими Услугами. Как вы знаете мы все пользовались бумажными мед картами и это было не очень удобно и не очень экологично. Потому-что была возможность потерять важные документы и справки,из-за неразборчевого почерка ставились неверные диагнозы, люди покупали неправильные лекарства. Пришло время менять эту систему.</p>
                        </div>
                        <div className="col-md-6">
                            <img src={vegroup} alt="" />
                        </div>
                        <div className="col-md-6">
                            <img src={vegroup2} alt="" />
                        </div>
                        <div className="col-md-6">
                            <p>В электронной карте будет все понятно и легко. Да это необычно и это новшество для вас но мы постараемся чтобы вы по достоинству оценили и пользовались нашим продуктом . Мы будем всегда его дорабатывать и обновлять. Эта карта будет у вас в телефоне, врачи не будут путаться и будет легкий доступ для всех . Вы можете в любой момент посмотреть болезни , посмотреть где находится ближайшая больница и аптека. Карта предоставляет возможность смотреть свою историю болезней.</p>
                        </div>
                        <div className="col-md-6">
                            <p>Централизованное хранение файлов дает мобильность нашему сайту.То есть из любого уголка,любой доктор запросив данные может ими ознакомится. В нашей электронной медицинской карте будет отображаться вся информация о пациенте и о том как он был на приеме у врача, кроме этого можно будет записаться на прием к врачу в электроном виде . Также результат накануне сданных анализов будут отсылаться пользователю с разъяснениями врача.</p>
                        </div>
                        <div className="col-md-6">
                            <img src={doxv} alt="" />
                        </div>
                    </div>

                <div id="price">
                    <h1 className="priceText">PRICE</h1>
                    <div className="row w-100">
                        <div className="col-md-4 ">
                            <div className="cards">
                                <h2>Страндарт</h2>
                                <h1>10.000 сум</h1>
                                <h4>нет бонусов</h4>
                                <h4>нет бонусов</h4>
                                <h4>нет бонусов</h4>
                                <h4>нет бонусов</h4>
                                <button  >оплатить</button>
                            </div>
                        </div>
                        <div className="col-md-4 ">
                            <div className="cards">
                                <h2>Золотой</h2>
                                <h1>12.000 сум</h1>
                                <h4>бонусов</h4>
                                <h4>нет бонусов</h4>
                                <h4>бонусов</h4>
                                <h4 >нет бонусов</h4>
                                <button  >оплатить</button>
                            </div>
                        </div>
                        <div className="col-md-4 ">
                            <div className="cards">
                                <h2>Элита</h2>
                                <h1>13.000 сум</h1>
                                <h4>бонусов</h4>
                                <h4>бонусов</h4>
                                <h4>бонусов</h4>
                                <h4>бонусов</h4>
                                <button  >оплатить</button>
                            </div>
                        </div>
                    </div>
                </div>

                {/* Aloqa */}
                <div id="aloqa" >
                    <h1 className="priceText text-center mt-5 pb-3" >связяться с нами</h1>
                    <div className="row  text-center aloqa">
                        <div className="col-md-3">
                            <div className="icon">
                                <svg xmlns="http://www.w3.org/2000/svg" width="35" height="35" fill="currentColor" class="bi bi-geo-alt" viewBox="0 0 16 16">
                                    <path d="M12.166 8.94c-.524 1.062-1.234 2.12-1.96 3.07A31.493 31.493 0 0 1 8 14.58a31.481 31.481 0 0 1-2.206-2.57c-.726-.95-1.436-2.008-1.96-3.07C3.304 7.867 3 6.862 3 6a5 5 0 0 1 10 0c0 .862-.305 1.867-.834 2.94zM8 16s6-5.686 6-10A6 6 0 0 0 2 6c0 4.314 6 10 6 10z" />
                                    <path d="M8 8a2 2 0 1 1 0-4 2 2 0 0 1 0 4zm0 1a3 3 0 1 0 0-6 3 3 0 0 0 0 6z" />
                                </svg>
                            </div>
                            <h1>Аддрес</h1>
                            <p>Узбекистан, Ферганская область, Фергана, <br /> ул. АЛЬ-ФАРГОНИ, 37 Б-А. Ориентиры: <br /> банк "НБУ"</p>
                        </div>
                        <div className="col-md-3">
                            <div className="icon">
                                <svg xmlns="http://www.w3.org/2000/svg" width="35" height="35" fill="currentColor" class="bi bi-envelope" viewBox="0 0 16 16">
                                    <path d="M0 4a2 2 0 0 1 2-2h12a2 2 0 0 1 2 2v8a2 2 0 0 1-2 2H2a2 2 0 0 1-2-2V4Zm2-1a1 1 0 0 0-1 1v.217l7 4.2 7-4.2V4a1 1 0 0 0-1-1H2Zm13 2.383-4.708 2.825L15 11.105V5.383Zm-.034 6.876-5.64-3.471L8 9.583l-1.326-.795-5.64 3.47A1 1 0 0 0 2 13h12a1 1 0 0 0 .966-.741ZM1 11.105l4.708-2.897L1 5.383v5.722Z" />
                                </svg>
                            </div>
                            <h1>Электронная Почта</h1>
                            <p>ibragimovdaler1305@gmail.com</p>
                            <p>anvarbekovzuhriddin@gmail.com</p>
                        </div>
                        <div className="col-md-3">
                            <div className="icon">
                                <svg xmlns="http://www.w3.org/2000/svg" width="35" height="35" fill="currentColor" class="bi bi-telephone" viewBox="0 0 16 16">
                                    <path d="M3.654 1.328a.678.678 0 0 0-1.015-.063L1.605 2.3c-.483.484-.661 1.169-.45 1.77a17.568 17.568 0 0 0 4.168 6.608 17.569 17.569 0 0 0 6.608 4.168c.601.211 1.286.033 1.77-.45l1.034-1.034a.678.678 0 0 0-.063-1.015l-2.307-1.794a.678.678 0 0 0-.58-.122l-2.19.547a1.745 1.745 0 0 1-1.657-.459L5.482 8.062a1.745 1.745 0 0 1-.46-1.657l.548-2.19a.678.678 0 0 0-.122-.58L3.654 1.328zM1.884.511a1.745 1.745 0 0 1 2.612.163L6.29 2.98c.329.423.445.974.315 1.494l-.547 2.19a.678.678 0 0 0 .178.643l2.457 2.457a.678.678 0 0 0 .644.178l2.189-.547a1.745 1.745 0 0 1 1.494.315l2.306 1.794c.829.645.905 1.87.163 2.611l-1.034 1.034c-.74.74-1.846 1.065-2.877.702a18.634 18.634 0 0 1-7.01-4.42 18.634 18.634 0 0 1-4.42-7.009c-.362-1.03-.037-2.137.703-2.877L1.885.511z" />
                                </svg>
                            </div>
                            <h1>Телефон</h1>
                            <p>+998 (97) 205-58-45</p>
                            <p>+998 (99) 602-13-48</p>
                        </div>
                        <div className="col-md-3">
                            <div className="icon">
                                <svg xmlns="http://www.w3.org/2000/svg" width="35" height="35" fill="currentColor" class="bi bi-link-45deg" viewBox="0 0 16 16">
                                    <path d="M4.715 6.542 3.343 7.914a3 3 0 1 0 4.243 4.243l1.828-1.829A3 3 0 0 0 8.586 5.5L8 6.086a1.002 1.002 0 0 0-.154.199 2 2 0 0 1 .861 3.337L6.88 11.45a2 2 0 1 1-2.83-2.83l.793-.792a4.018 4.018 0 0 1-.128-1.287z" />
                                    <path d="M6.586 4.672A3 3 0 0 0 7.414 9.5l.775-.776a2 2 0 0 1-.896-3.346L9.12 3.55a2 2 0 1 1 2.83 2.83l-.793.792c.112.42.155.855.128 1.287l1.372-1.372a3 3 0 1 0-4.243-4.243L6.586 4.672z" />
                                </svg>
                            </div>
                            <h1>Социальные Сети</h1>
                            <div className="row">
                                <div className="col-md-6">
                                    <p>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" fill="currentColor" class="bi bi-instagram p-1" viewBox="0 0 16 16">
                                            <path d="M8 0C5.829 0 5.556.01 4.703.048 3.85.088 3.269.222 2.76.42a3.917 3.917 0 0 0-1.417.923A3.927 3.927 0 0 0 .42 2.76C.222 3.268.087 3.85.048 4.7.01 5.555 0 5.827 0 8.001c0 2.172.01 2.444.048 3.297.04.852.174 1.433.372 1.942.205.526.478.972.923 1.417.444.445.89.719 1.416.923.51.198 1.09.333 1.942.372C5.555 15.99 5.827 16 8 16s2.444-.01 3.298-.048c.851-.04 1.434-.174 1.943-.372a3.916 3.916 0 0 0 1.416-.923c.445-.445.718-.891.923-1.417.197-.509.332-1.09.372-1.942C15.99 10.445 16 10.173 16 8s-.01-2.445-.048-3.299c-.04-.851-.175-1.433-.372-1.941a3.926 3.926 0 0 0-.923-1.417A3.911 3.911 0 0 0 13.24.42c-.51-.198-1.092-.333-1.943-.372C10.443.01 10.172 0 7.998 0h.003zm-.717 1.442h.718c2.136 0 2.389.007 3.232.046.78.035 1.204.166 1.486.275.373.145.64.319.92.599.28.28.453.546.598.92.11.281.24.705.275 1.485.039.843.047 1.096.047 3.231s-.008 2.389-.047 3.232c-.035.78-.166 1.203-.275 1.485a2.47 2.47 0 0 1-.599.919c-.28.28-.546.453-.92.598-.28.11-.704.24-1.485.276-.843.038-1.096.047-3.232.047s-2.39-.009-3.233-.047c-.78-.036-1.203-.166-1.485-.276a2.478 2.478 0 0 1-.92-.598 2.48 2.48 0 0 1-.6-.92c-.109-.281-.24-.705-.275-1.485-.038-.843-.046-1.096-.046-3.233 0-2.136.008-2.388.046-3.231.036-.78.166-1.204.276-1.486.145-.373.319-.64.599-.92.28-.28.546-.453.92-.598.282-.11.705-.24 1.485-.276.738-.034 1.024-.044 2.515-.045v.002zm4.988 1.328a.96.96 0 1 0 0 1.92.96.96 0 0 0 0-1.92zm-4.27 1.122a4.109 4.109 0 1 0 0 8.217 4.109 4.109 0 0 0 0-8.217zm0 1.441a2.667 2.667 0 1 1 0 5.334 2.667 2.667 0 0 1 0-5.334z" />
                                        </svg>
                                        Instagram</p>
                                </div>
                                <div className="col-md-6">
                                    <p>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" fill="currentColor" class="bi bi-telegram p-1" viewBox="0 0 16 16">
                                            <path d="M16 8A8 8 0 1 1 0 8a8 8 0 0 1 16 0zM8.287 5.906c-.778.324-2.334.994-4.666 2.01-.378.15-.577.298-.595.442-.03.243.275.339.69.47l.175.055c.408.133.958.288 1.243.294.26.006.549-.1.868-.32 2.179-1.471 3.304-2.214 3.374-2.23.05-.012.12-.026.166.016.047.041.042.12.037.141-.03.129-1.227 1.241-1.846 1.817-.193.18-.33.307-.358.336a8.154 8.154 0 0 1-.188.186c-.38.366-.664.64.015 1.088.327.216.589.393.85.571.284.194.568.387.936.629.093.06.183.125.27.187.331.236.63.448.997.414.214-.02.435-.22.547-.82.265-1.417.786-4.486.906-5.751a1.426 1.426 0 0 0-.013-.315.337.337 0 0 0-.114-.217.526.526 0 0 0-.31-.093c-.3.005-.763.166-2.984 1.09z" />
                                        </svg>
                                        Telegram</p>
                                </div>
                                <div className="col-md-6">
                                    <p>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" fill="currentColor" class="bi bi-facebook p-1" viewBox="0 0 16 16">
                                            <path d="M16 8.049c0-4.446-3.582-8.05-8-8.05C3.58 0-.002 3.603-.002 8.05c0 4.017 2.926 7.347 6.75 7.951v-5.625h-2.03V8.05H6.75V6.275c0-2.017 1.195-3.131 3.022-3.131.876 0 1.791.157 1.791.157v1.98h-1.009c-.993 0-1.303.621-1.303 1.258v1.51h2.218l-.354 2.326H9.25V16c3.824-.604 6.75-3.934 6.75-7.951z" />
                                        </svg>
                                        Facebook</p>
                                </div>
                                <div className="col-md-6">
                                    <p>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" fill="currentColor" class="bi bi-twitter p-1" viewBox="0 0 16 16">
                                            <path d="M5.026 15c6.038 0 9.341-5.003 9.341-9.334 0-.14 0-.282-.006-.422A6.685 6.685 0 0 0 16 3.542a6.658 6.658 0 0 1-1.889.518 3.301 3.301 0 0 0 1.447-1.817 6.533 6.533 0 0 1-2.087.793A3.286 3.286 0 0 0 7.875 6.03a9.325 9.325 0 0 1-6.767-3.429 3.289 3.289 0 0 0 1.018 4.382A3.323 3.323 0 0 1 .64 6.575v.045a3.288 3.288 0 0 0 2.632 3.218 3.203 3.203 0 0 1-.865.115 3.23 3.23 0 0 1-.614-.057 3.283 3.283 0 0 0 3.067 2.277A6.588 6.588 0 0 1 .78 13.58a6.32 6.32 0 0 1-.78-.045A9.344 9.344 0 0 0 5.026 15z" />
                                        </svg>
                                        Twitter</p>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <Footer />
        </div>
    )
}